Show / Hide Table of Contents
Class BondedTendon
Bonded tendon
Inheritance
System.Object
OpenObject
OpenElementId
Tendon
BondedTendon
Inherited Members
 Tendon.Material
 Tendon.NumberOfStrand
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Model
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Structure.BondedTendon,CI.StructuralElements", "CI.StructModel.Structure.IBondedTendon,CI.BasicTypes", typeof(Tendon))]
public class BondedTendon : Tendon
Constructors
Improve this Doc   View Source
BondedTendon()
Constructor
Declaration
public BondedTendon()
Properties
Improve this Doc   View Source
Geometry
Geometry
Declaration
public Polygon3D Geometry { get; set; }
Property Value
 Type |  Description
 Polygon3D
 Improve this Doc
 View Source